In [11]:
import pandas as pd
import numpy as np

In [12]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  5  7  2  9  6
1  1  2  3  6  9
2  6  9  8  5  1
3  8  3  4  6  1
4  4  4  9  2  5

In [13]:
df = df.rename(columns = {'A':'Jakarta'})

In [14]:
df = df.rename(columns={'C':'alamat', 'D':'halo','B':'pekerjaan'})
df

   Jakarta  pekerjaan  alamat  halo  E
0        5          7       2     9  6
1        1          2       3     6  9
2        6          9       8     5  1
3        8          3       4     6  1
4        4          4       9     2  5

In [15]:
df.columns

Index(['Jakarta', 'pekerjaan', 'alamat', 'halo', 'E'], dtype='object')

In [16]:
df = df[['halo', 'Jakarta', 'pekerjaan', 'alamat', 'E']]

In [17]:
df

   halo  Jakarta  pekerjaan  alamat  E
0     9        5          7       2  6
1     6        1          2       3  9
2     5        6          9       8  1
3     6        8          3       4  1
4     2        4          4       9  5

In [ ]:
df['F'] = np.nan

In [ ]:
df

In [ ]:
df.to_excel('data_latihan.xlsx', index=False)
df = pd.read_excel('data_latihan.xlsx')
df